---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecEnclosure
source: html/4c84b854-5a5d-48ec-526f-feb2f7185221.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecEnclosure Property

"Enclosure"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecEnclosure { get; }
```